//
//  ViewController.swift
//  舌尖神器
//
//  Created by 王宁 on 2017/5/20.
//  Copyright © 2017年 mrwang90hou. All rights reserved.
//

import UIKit
import Social
class ViewController: UIViewController {

    var select_btn:UIButton?
    
    var cook:UIPickerView?
    var cookers01 = ["煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤"]//9种做法
    let cookers = ["煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤",
                   "煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤","煮","炒","蒸","焖","烧","蜜汁","涮","炖","卤"]
    
    
    
    
    var vegetable:UIPickerView?
    let vegetables = ["小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹",
                      "小青菜","包菜","紫甘蓝","生菜","菠菜","韭菜","韭黄","韭菜花","蒜苗","芹菜","水芹"]//11种蔬菜

    /*蔬菜类
 
    叶菜类： 结球白菜，不结球白菜，紫背天葵，抱子甘蓝，羽衣甘蓝，大白菜，小白菜，青菜，
     
     　　小青菜，包菜，紫甘蓝，生菜，菠菜，韭菜，韭黄，韭菜花，蒜苗，芹菜，水芹，龙须菜，苦菊，菊花脑，油麦菜，人参菜，黄秋葵，富贵菜，台湾番薯叶，紫背菜，空心菜，茼蒿，苋菜，香椿，冲菜，贡菜，娃娃菜，苔干叶，山蛰菜，芥兰，广东菜芯，荠菜，茴香，马齿苋，莼菜，金花菜，发菜，苜蓿菜，木耳叶，海带，紫菜，海白菜、蕹菜、芥菜、 结球甘蓝、结球莴苣、包心芥菜、米苋、葱、芜荽(大叶香菜、小叶香菜)、雪里蕻、油菜、瓢儿菜、辣根、罗汉菜
     
    根茎类：   萝卜(白罗卜，胡罗卜，水罗卜)，大葱，小葱，蒜，洋葱，生姜，洋姜，莲菜，
     　　蒜薹，韭菜薹，莴笋，山药，芋头，魔芋，土豆，红薯，凉薯，桔梗丝，宝塔菜(地瘤)，芦笋，竹笋，牛蒡，茭白，鱼腥草，荞头，鲜榨菜，荸荠，菱角，蕨菜、莴苣、慈姑、金针菜、石刁柏(芦笋)、大头菜(根用芥菜)、 芜普、芜菁甘蓝、根用甜菜、豆薯、葛、球茎甘蓝、百合、莲藕
    芽苗菜：  豌豆芽、香椿芽、萝卜芽、荞麦芽、花生芽、姜芽、黄豆芽，绿豆芽，豆苗， 花菜类:花椰菜、金针菜、青花菜、紫菜蔓、 朝鲜蓟和芥蓝
    果菜类：辣椒(菜椒，青椒，尖椒，甜椒，朝天椒，螺丝椒)，南瓜，金南瓜，冬瓜，苦瓜，
     
     　　乳瓜，黄瓜，丝瓜，佛手瓜，菜瓜，胡瓜，瓠瓜、菜瓜、西葫芦，番茄，茄子，芸豆，豇豆，豌豆，架豆，刀豆，扁豆，青豆，毛豆，蛇豆，玉米，玉米尖，蚕豆、菜豆、眉豆、四棱豆、蛇瓜，
     
    菌类：木耳，银耳，地耳，石耳，平菇，草菇，口蘑，猴头菇，金针菇，香菇，
     
     　　鸡腿菇，竹荪，凤尾菇，茶树菇，杏鲍菇，秀珍菇，猪肚菇，裙带菜
     
    瓜类：西瓜，美人瓜，甜瓜，香瓜，黄河蜜，哈密瓜，木瓜，乳瓜
     
 */
    
    /*肉类
     红肉：牛肉、猪肉、羊肉等的肌肉、内脏极其制品，这些畜肉的肌色较深，呈暗红色。
     白肉：鱼肉、鸡肉、鸭肉等，以水产动物和禽类为主，它们的肉色较浅，呈白色。
     加工肉类：香肠、腊肉、火腿、腌肉等肉制品。
 
 
 
 */
    var meat:UIPickerView?
    let meats = ["牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋",
                 "牛肉","羊肉","猪肉","鱼肉","鸡肉","鸭肉","香肠","腊肉","火腿","蛋"]//荤菜10种
    
    
    
    //let Total = [vegetables,cookers,meats]
    
    var facebook:UIButton?
    
    var twitter:UIButton?
    
    var weibo:UIButton?
  
    //var label:UILabel
    
    override func viewDidLoad() {
        super.viewDidLoad()
        vegetable = self.view.viewWithTag(1) as? UIPickerView
        
        cook = self.view.viewWithTag(2) as? UIPickerView
        
        meat = self.view.viewWithTag(3) as? UIPickerView
        
        facebook = self.view.viewWithTag(4) as? UIButton
        
        twitter = self.view.viewWithTag(5) as? UIButton
        weibo = self.view.viewWithTag(6) as? UIButton
        select_btn = self.view.viewWithTag(7) as? UIButton
        select_btn?.addTarget(self, action: #selector(self.select), for: UIControlEvents.touchUpInside)
       /*
        for _ in 1...2{
            cookers01 = cookers01 + cookers01
            print(cookers01)
        }
        let cookers = cookers01
        
///////////*******************************///////////////
        */
        cook?.dataSource = self
        cook?.delegate = self
        //let Total = [vegetables,cookers,meats]
        cook?.selectRow(vegetables.count/2, inComponent: 0, animated: false)
        cook?.selectRow(cookers.count/2, inComponent: 1, animated: true)
        cook?.selectRow(meats.count/2, inComponent: 2, animated: false)
 
    
        //自动选择
        func select()
        {
//            cook?.selectRow(vegetables.count/2, inComponent: 0, animated: false)
//            cook?.selectRow(cookers.count/2, inComponent: 1, animated: true)
//            cook?.selectRow(meats.count/2, inComponent: 2, animated: false)
//            
            print("点击了select！")
            
//            UserDefaults.standard.set(userName?.text, forKey: "username")
//            UserDefaults.standard.set(pwd?.text,forKey:"pwd")
        }
        

        
        
        
        
        /*
        vegetable?.dataSource = self
        vegetable?.delegate = self
        
        meat?.dataSource = self
        meat?.delegate = self
        */
        // Do any additional setup after loading the view, typically from a nib.
        
        
        
    }
    
    let beautyImage = UIImage(named:"mouth")
    
    @IBAction func facebookTapped(_ sender: AnyObject) {
        let controller:SLComposeViewController = SLComposeViewController(forServiceType: SLServiceTypeFacebook)
        controller.setInitialText("一起来玩舌尖👅神器App，Github上的源码在 https://github.com/mrwang90hou/TongueArtifact")
        controller.add(beautyImage)
        self.present(controller, animated: true, completion: nil)
        
    }
    
    @IBAction func twitterTapped(_ sender: AnyObject) {
        let controller:SLComposeViewController = SLComposeViewController(forServiceType: SLServiceTypeTwitter)
        controller.setInitialText("一起来玩舌尖👅神器App，Github上的源码在 https://github.com/mrwang90hou/TongueArtifact")
        controller.add(beautyImage)
        self.present(controller, animated: true, completion: nil)
    }
    
    
    @IBAction func weiboTapped(_ sender: AnyObject) {
        let controller:SLComposeViewController = SLComposeViewController(forServiceType: SLServiceTypeSinaWeibo)
        controller.setInitialText("一起来玩舌尖👅神器App，Github上的源码在 https://github.com/mrwang90hou/TongueArtifact")
        controller.add(beautyImage)
        self.present(controller, animated: true, completion: nil)
    }

 
    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }


}

class DownloadManagerTableTableViewController: UITableViewController {
    
    var timer : Timer?
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
    }
    //页面显示之前设定定时器
    override func viewDidAppear(_ animated: Bool) {
        super.viewDidAppear(animated)
        self.timer = Timer.scheduledTimer(timeInterval: 0.5, target: self, selector: #selector(DownloadManagerTableTableViewController.timerFired), userInfo: nil, repeats: true)
        
    }

    //页面消失后关闭定时器
    override func viewDidDisappear(_ animated: Bool) {
        super.viewDidDisappear(animated)
        guard let timer = self.timer
            else { return }
        timer.invalidate()
    }
    func timerFired () {
        //print("timer ticked")
        self.tableView.reloadData()
    }
    
    
}
